[{"content": "i love turtle beach, been using it non stop for 4 years, very affordable and very much worth the money, i had the same one in black and the mic got staticky after 2 months of having it because i dropped it, the battery is amazing, i charge my headset twice a month and i game for a long time lol, i love the audio modes , u can change it to however you want it, and overall this is just an awesome headset for gaming and very pretty, i’ve had my other headset, same as this but black, for about 8 months i’d say, these do last a long time and it’s very much worth it", "author": "busymominfl", "date": "June 7, 2023"}, {"content": "This headset was so simple to set up. All I had to do was plug in the USB and my headset was working. There were no configuration screens and no wires to get the mic to work. It was so simple I was amazed! Great sound and is able to go on mute just by lifting the mic. Battery life is amazing. I have used it for multiple days with no charge necessary. When I do charge the headset it takes very little time before the charge is complete. Worth the buy!", "author": "Davinna", "date": "June 21, 2023"}, {"content": "I've had these for a couple months now and use about an hour every day. I have only had to charge it ONE time so far (and it continued to work when wired up to charge). Amazing battery life. They're fairly comfortable, work well under Linux.\n\nThe mic monitoring feature is Turtle Beach's differentiator and I'm glad to have it, although it picks up a bit more white noise than I would like. Seems like my old wired Turtle Beach headset had better filtering on the mic monitor.\n\nThere is no noticeable latency; I can play a digital piano just fine - an impossible feat with higher latency Bluetooth speakers.\n\nSound quality for voice and music seems fine, but I'm no audiophile. The audio profile switching button (that I never use) is slightly proud and the power button is slightly recessed, I wish that was reversed. I don't have any *real* issues with the headset.", "author": "Q", "date": "May 27, 2023"}, {"content": "I love this headset, but honestly I hated it at first. The sound quality is great, I love that all audio settings are on the headset itself so I don’t have to go into party chat settings on my Xbox, setting it up was simple and straightforward. My only issue was how tight it was out of the box. I don’t have an overly large head either, I’m a woman and I have what I would consider an average size head for a woman. But this headset would give me migraines with how tight it was, and hours long gaming sessions were a no go. I ended up starting to leave the headset propped on my Xbox series x like the console was wearing them to stretch it out overnight and after about 3 days I got it to a comfortable grip on my head. Other than that issue (which is no longer an issue) this headset is well worth the money", "author": "DoggyMomma", "date": "April 20, 2023"}, {"content": "If you're having an issue with mic monitoring picking up every sound in your house, there's two ways you can adjust it.\n\n1. turn dongle switch from \"xbox\" to \"usb\" then adjust audio setting from the home button audio menu at the bottom right. Then switch back.\n\n2. Download the Turtle beach audio hub app on your PC or Mac. Connect dongle in \"usb\" mode and plug headset into a port. Update and change mic monitoring levels from app.\n\nBought these for my fiancée and the mic monitoring was terrible. Now it's much better.", "author": "ALPHAKASH", "date": "May 18, 2023"}, {"content": "Long time ago when Xbox 360 first came out, I also bought a pair of turtle beach headsets after hearing they were one of the best headsets you could own in terms of sound, comfort, and quality and they weren't kidding, I loved them and now years later being a PC Gamer I bought this pair because wanted to re-live my Xbox 360 days and while the headset worked great, it was specifically designed for Xbox and not PC which meant I couldn't have a custom sound. That may not be a big deal to some people but I like to customize my sound because without it, the headset to me sounded like a cheap pair of headphones.", "author": "J-MAN", "date": "April 28, 2023"}, {"content": "I’ve had these for about 2mo now and absolutely LOVE THEM!! One of the best purchases so far. The only thing I’m not a fan of is when there’s intense echoing BUT that can happen with ALL wireless gaming headsets so that’s not anything against these because aside from that general issue I have sometimes I can say with 100% certainty that I’d buy these again in a heartbeat!! So if you’re thinking about getting a pair DO IT! You WON’T regret it!", "author": "Lynnmarie1996", "date": "June 9, 2023"}, {"content": "I had pre-ordered these a few months ago. I needed a new turtle beach headset since getting a PS5, primarily so I could crossplay between both PS5 and Xbox consoles. I've been using it almost every game play and have had zero connection problems.\n\nMy only comment is that sometimes when I am transferring the USB port inbetween consoles, the headset sound doesn't pick up my voice correctly. After extended use it has gotten better, so it happens pretty rarely now.", "author": "Skylar", "date": "June 6, 2023"}, {"content": "I’ve only use this headset once but so far it’s very good. The sound is really good. You can hear everything in game highly recommend.", "author": "steven", "date": "July 3, 2023"}, {"content": "Very adjustable and comfortable. You can wear with glasses and not feel uncomfortable. Game sound and chat are separate volumes allowing you to control them separately. Love them!", "author": "Bernardo", "date": "June 30, 2023"}]